Mickyleitor/RollerShutterControlPanel/Firmware_ESP8266/lcd.h
/*
void actionSubirPersiana()
{
    uint8_t _localShutterIndex = (_seleccionMenu - SELECCION_MENU_NONE) - 1;
    if (ShutterData[_localShutterIndex].status != SHUTTER_STATUS_STOPPED)
    {
        PararPersiana(_localShutterIndex);
    }
    else
    {
        subirPersiana(_localShutterIndex);
    }
}

void actionBajarPersiana()
{
    uint8_t _localShutterIndex = (_seleccionMenu - SELECCION_MENU_NONE) - 1;
    if (ShutterData[_localShutterIndex].status != SHUTTER_STATUS_STOPPED)
    {
        PararPersiana(_localShutterIndex);
    }
    else
    {
        bajarPersiana(_localShutterIndex);
    }
}

void actionJobMode()
{
}

void actionIncreaseDaySelected()
{
}

void actionDecreaseDaySelected()
{
}

void actionIncreaseMonthSelected()
{
}

void actionDecreaseMonthSelected()
{
}

void actionRegisterSleepMode()
{
}

// Define a structure to represent menu transitions
struct MenuTransition {
    uint8_t left;
    uint8_t right;
    uint8_t up;
    uint8_t down;
    void (*actionLeft)();
    void (*actionRight)();
    void (*actionUp)();
    void (*actionDown)();
};

// Define menu transitions for each menu item with associated actions
const struct MenuTransition menuTransitions[] = {
    {SELECCION_MENU_NONE, SELECCION_MENU_NONE, SELECCION_MENU_NONE, SELECCION_MENU_NONE, NULL, NULL, NULL, NULL},
    {SELECCION_MENU_INFO, SELECCION_MENU_PERSIANA_CENTRAL, SELECCION_MENU_NONE, SELECCION_MENU_NONE, NULL, NULL, actionSubirPersiana, actionBajarPersiana},
    {SELECCION_MENU_PERSIANA_IZQUIERDA, SELECCION_MENU_PERSIANA_DERECHA, SELECCION_MENU_NONE, SELECCION_MENU_NONE, NULL, NULL, actionSubirPersiana, actionBajarPersiana},
    {SELECCION_MENU_PERSIANA_CENTRAL, SELECCION_MENU_JOB_MODE, SELECCION_MENU_NONE, SELECCION_MENU_NONE, NULL, NULL, actionSubirPersiana, actionBajarPersiana},
    {SELECCION_MENU_PERSIANA_DERECHA, SELECCION_MENU_SLEEP_MODE, SELECCION_MENU_NONE, SELECCION_MENU_NONE, NULL, NULL, NULL, actionJobMode},
    {SELECCION_MENU_JOB_MODE, SELECCION_MENU_INFO, SELECCION_MENU_NONE, SELECCION_MENU_SLEEP_MODE_ACTIVATE, NULL, NULL, NULL, NULL},
    {SELECCION_MENU_SLEEP_MODE, SELECCION_MENU_SLEEP_MODE_DEACTIVATE, SELECCION_MENU_NONE, SELECCION_MENU_SLEEP_MODE_ACTIVATE_SEL_DATE_DAY, NULL, NULL, NULL, NULL},
    {SELECCION_MENU_SLEEP_MODE_ACTIVATE, SELECCION_MENU_SLEEP_MODE_ACTIVATE_SEL_DATE_MONTH, SELECCION_MENU_NONE, SELECCION_MENU_NONE, NULL, NULL, actionIncreaseDaySelected, actionDecreaseDaySelected},
    {SELECCION_MENU_SLEEP_MODE_ACTIVATE_SEL_DATE_DAY, SELECCION_MENU_SLEEP_MODE_ACTIVATE_CONFIRM, SELECCION_MENU_NONE, SELECCION_MENU_NONE, NULL, NULL, actionIncreaseMonthSelected, actionDecreaseMonthSelected},
    {SELECCION_MENU_SLEEP_MODE_ACTIVATE_SEL_DATE_MONTH, SELECCION_MENU_SLEEP_MODE, SELECCION_MENU_NONE, SELECCION_MENU_NONE, NULL, actionRegisterSleepMode, NULL, NULL},
    {SELECCION_MENU_SLEEP_MODE_ACTIVATE, SELECCION_MENU_SLEEP_MODE_ACTIVATE_ALL, SELECCION_MENU_NONE, SELECCION_MENU_SLEEP_MODE_DEACTIVATE_SEL_DATE_DAY, NULL, NULL, NULL, NULL},
    {SELECCION_MENU_SLEEP_MODE_DEACTIVATE, SELECCION_MENU_SLEEP_MODE_DEACTIVATE_SEL_DATE_DAY, SELECCION_MENU_NONE, SELECCION_MENU_NONE, NULL, NULL, actionIncreaseDaySelected, actionDecreaseDaySelected},
    {SELECCION_MENU_SLEEP_MODE_DEACTIVATE_SEL_DATE_DAY, SELECCION_MENU_SLEEP_MODE_DEACTIVATE_CONFIRM, SELECCION_MENU_NONE, SELECCION_MENU_NONE, NULL, NULL, actionIncreaseMonthSelected, actionDecreaseMonthSelected},
    {SELECCION_MENU_SLEEP_MODE_DEACTIVATE_SEL_DATE_MONTH, SELECCION_MENU_SLEEP_MODE, SELECCION_MENU_NONE, SELECCION_MENU_NONE, NULL, actionRegisterSleepMode, NULL, NULL},
    {SELECCION_MENU_SLEEP_MODE_DEACTIVATE, SELECCION_MENU_SLEEP_MODE_DEACTIVATE_ALL, SELECCION_MENU_NONE, SELECCION_MENU_SLEEP_MODE_ACTIVATE_ALL_CONFIRM, NULL, NULL, NULL, NULL},
    {SELECCION_MENU_SLEEP_MODE_ACTIVATE_ALL, SELECCION_MENU_SLEEP_MODE, SELECCION_MENU_NONE, SELECCION_MENU_NONE, NULL, actionRegisterSleepMode, NULL, NULL},
    {SELECCION_MENU_SLEEP_MODE_ACTIVATE_ALL, SELECCION_MENU_NONE, SELECCION_MENU_NONE, SELECCION_MENU_DEACTIVATE_ALL, NULL, NULL, NULL, NULL},
    {SELECCION_MENU_SLEEP_MODE_DEACTIVATE_ALL, SELECCION_MENU_SLEEP_MODE, SELECCION_MENU_NONE, SELECCION_MENU_NONE, NULL, actionRegisterSleepMode, NULL, NULL},
    {SELECCION_MENU_SLEEP_MODE, SELECCION_MENU_PERSIANA_IZQUIERDA, SELECCION_MENU_NONE, SELECCION_MENU_INFO_WIFI_STATUS, NULL, NULL, NULL, NULL},
    {SELECCION_MENU_INFO, SELECCION_MENU_INFO_WIFI_SSID, SELECCION_MENU_NONE, SELECCION_MENU_NONE, NULL, NULL, NULL, NULL},
    {SELECCION_MENU_INFO_WIFI_STATUS, SELECCION_MENU_INFO_WIFI_IP, SELECCION_MENU_NONE, SELECCION_MENU_NONE, NULL, NULL, NULL, NULL},
    {SELECCION_MENU_INFO_WIFI_SSID, SELECCION_MENU_NONE, SELECCION_MENU_NONE, SELECCION_MENU_NONE, NULL, NULL, NULL, NULL},
};

// Define a function to handle button presses and menu transitions
void handleButtonFromMenu(uint8_t * _localMenu, uint8_t _localButton) {
    uint8_t _nextMenu = *_localMenu;
    
    if (_nextMenu < sizeof(menuTransitions) / sizeof(menuTransitions[0])) {
        const struct MenuTransition *transitions = &menuTransitions[_nextMenu];
        
        switch (_localButton) {
            case BUTTON_STATUS_LEFT:
                if (transitions->actionLeft) {
                    transitions->actionLeft();
                }
                if ( transitions->left != SELECCION_MENU_NONE)
                {
                    _nextMenu = transitions->left;
                }
                break;
            case BUTTON_STATUS_RIGHT:
                if (transitions->actionRight) {
                    transitions->actionRight();
                }
                if ( transitions->right != SELECCION_MENU_NONE)
                {
                    _nextMenu = transitions->right;
                }
                break;
            case BUTTON_STATUS_UP:
                if (transitions->actionUp) {
                    transitions->actionUp();
                }
                if ( transitions->up != SELECCION_MENU_NONE)
                {
                    _nextMenu = transitions->up;
                }
                break;
            case BUTTON_STATUS_DOWN:
                if (transitions->actionDown) {
                    transitions->actionDown();
                }
                if ( transitions->down != SELECCION_MENU_NONE)
                {
                    _nextMenu = transitions->down;
                }
                break;
        }
    }
    
    *_localMenu = _nextMenu;
}
*/

void actualizarMenuPantalla(uint8_t _localMenu)
{
    String lcdBuffer = "";
    switch (_localMenu)
    {
        case SELECCION_MENU_NONE:
            break;
        case SELECCION_MENU_PERSIANA_IZQUIERDA :
            // fall through
        case SELECCION_MENU_PERSIANA_CENTRAL :
            // fall through
        case SELECCION_MENU_PERSIANA_DERECHA :
        {
            String namePersiana[] = {" PERSIANA IZQDA ", "PERSIANA CENTRAL", "PERSIANA DERECHA"};
            uint8_t _localShutterIndex = (SELECCION_MENU_PERSIANA_TO_INDEX(_localMenu));

            lcdBuffer += namePersiana[_localShutterIndex];
            lcdBuffer += String("<    ");

            if (ShutterData[_localShutterIndex].status == SHUTTER_STATUS_MOVING_UP) {
                lcdBuffer += LCD_SPECIAL_CHAR_STOP_ARROW;
            } else {
                lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
            }

            lcdBuffer += String("    ");

            if (ShutterData[_localShutterIndex].status == SHUTTER_STATUS_MOVING_DOWN) {
                lcdBuffer += LCD_SPECIAL_CHAR_STOP_ARROW;
            } else {
                lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            }

            lcdBuffer += String("    >");
            break;
        }
        case SELECCION_MENU_JOB_MODE:
        {
            lcdBuffer += String("  MODO TRABAJO  <    ");
            lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            lcdBuffer += String(" OK ");
            lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            lcdBuffer += String("    >");
            break;
        }
        case SELECCION_MENU_SLEEP_MODE:
        {
            lcdBuffer += String("  MODO DORMIR   <    ");
            lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            lcdBuffer += String(" OK ");
            lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            lcdBuffer += String("    >");
            break;
        }
        case SELECCION_MENU_SLEEP_MODE_ACTIVATE:
        {
            lcdBuffer += String(" ACTIVAR UN DIA ");
            lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW_CAN;
            lcdBuffer += String("    ");
            lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            lcdBuffer += String(" OK ");
            lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            lcdBuffer += String("    >");
            break;
        }
        case SELECCION_MENU_SLEEP_MODE_ACTIVATE_SEL_DATE_DAY:
        {
            lcdBuffer += String("SEL. DIA:  ");
            lcdBuffer += makeLcdStringDate(sleepModeDaySelected, sleepModeMonthSelected);
            lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW_CAN;
            lcdBuffer += String("    ");
            lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
            lcdBuffer += String("    ");
            lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            lcdBuffer += String("    >");
            break;
        }
        case SELECCION_MENU_SLEEP_MODE_ACTIVATE_SEL_DATE_MONTH:
        {
            lcdBuffer += String("SEL. MES:  ");
            lcdBuffer += makeLcdStringDate(sleepModeDaySelected, sleepModeMonthSelected);
            lcdBuffer += String("<    ");
            lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
            lcdBuffer += String("    ");
            lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            lcdBuffer += String("    >");
            break;
        }
        case SELECCION_MENU_SLEEP_MODE_ACTIVATE_CONFIRM:
        {
            lcdBuffer += String("CONFIRMAR  FECHA");
            lcdBuffer += String("<    ");
            lcdBuffer += makeLcdStringDate(sleepModeDaySelected, sleepModeMonthSelected);
            lcdBuffer += String("    OK");
            break;
        }
        case SELECCION_MENU_SLEEP_MODE_DEACTIVATE:
        {
            lcdBuffer += String("CANCELAR UN DIA <    ");
            lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            lcdBuffer += String(" OK ");
            lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            lcdBuffer += String("    >");
            break;
        }
        case SELECCION_MENU_SLEEP_MODE_DEACTIVATE_SEL_DATE_DAY:
        {
            lcdBuffer += String("SEL. DIA:  ");
            lcdBuffer += makeLcdStringDate(sleepModeDaySelected, sleepModeMonthSelected);
            lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW_CAN;
            lcdBuffer += String("    ");
            lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
            lcdBuffer += String("    ");
            lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            lcdBuffer += String("    >");
            break;
        }
        case SELECCION_MENU_SLEEP_MODE_DEACTIVATE_SEL_DATE_MONTH:
        {
            lcdBuffer += String("SEL. MES:  ");
            lcdBuffer += makeLcdStringDate(sleepModeDaySelected, sleepModeMonthSelected);
            lcdBuffer += String("<    ");
            lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
            lcdBuffer += String("    ");
            lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            lcdBuffer += String("    >");
            break;
        }
        case SELECCION_MENU_SLEEP_MODE_DEACTIVATE_CONFIRM:
        {
            lcdBuffer += String("CONFIRMAR  FECHA");
            lcdBuffer += String("<    ");
            lcdBuffer += makeLcdStringDate(sleepModeDaySelected, sleepModeMonthSelected);
            lcdBuffer += String("    OK");
            break;
        }
        case SELECCION_MENU_SLEEP_MODE_ACTIVATE_ALL:
        {
            lcdBuffer += String("ACTIVAR  SIEMPRE<    ");
            lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            lcdBuffer += String(" OK ");
            lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            lcdBuffer += String("    >");
            break;
        }
        case SELECCION_MENU_SLEEP_MODE_ACTIVATE_ALL_CONFIRM:
        {
            lcdBuffer += String("ACTIVAR SIEMPRE?");
            lcdBuffer += String("<             OK");
            break;
        }
        case SELECCION_MENU_SLEEP_MODE_DEACTIVATE_ALL:
        {
            lcdBuffer += String(" CANCELAR TODO  <    ");
            lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            lcdBuffer += String(" OK ");
            lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            lcdBuffer += String("     ");
            break;
        }
        case SELECCION_MENU_SLEEP_MODE_DEACTIVATE_ALL_CONFIRM:
        {
            lcdBuffer += String(" CANCELAR TODO? ");
            lcdBuffer += String("<             OK");
            break;
        }
        case SELECCION_MENU_INFO:
            // fall through
        case SELECCION_MENU_INFO_WIFI_STATUS:
            // fall through
        case SELECCION_MENU_INFO_WIFI_SSID:
            // fall through
        case SELECCION_MENU_INFO_WIFI_IP:
        {
            lcdBuffer += String("NOT  IMPLEMENTED");
            lcdBuffer += String("<              >");
            break;
        }
    }
    sendLcdBuffer(lcdBuffer);
}